fu1fan/smart-pot-companion/esp32/smart_pot_esp32p4/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

CONFIG_FREERTOS_HZ=1000
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_FREERTOS_USE_TRACE_FACILITY=n
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_SOURCE_HAN_SANS_SC_16_CJK=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SYSMON=y
# CONFIG_LV_USE_PERF_MONITOR is not set
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_RENDER=n
CONFIG_LV_USE_DEMO_SCROLL=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_TRANSFORM=n
CONFIG_LV_USE_DEMO_MUSIC=n
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=n
CONFIG_LV_USE_DEMO_MULTILANG=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# The ESP32-P4 hardware AES driver needs internal DMA descriptors during TLS
# handshakes. Display/audio/Wi-Fi already put that heap under pressure, so use
# software AES to keep WebSocket ASR/TTS connections reliable.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
CONFIG_WS_BUFFER_SIZE=8192
CONFIG_WS_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
# Keep concurrent DeepSeek and Volcengine TLS/WebSocket allocations out of the
# scarce internal DMA heap. Audio DMA remains protected by the reserve above.
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

CONFIG_SMART_POT_WIFI_ENABLE=y
CONFIG_SMART_POT_WIFI_SSID=""
CONFIG_SMART_POT_WIFI_PASSWORD=""
CONFIG_SMART_POT_WIFI_MAXIMUM_RETRY=5
CONFIG_SMART_POT_CLOUD_ENABLE=n
CONFIG_SMART_POT_DEVICE_ID="smartpot-p4-001"
CONFIG_SMART_POT_MQTT_URI="mqtt://103.236.87.90:1883"
CONFIG_SMART_POT_MQTT_USERNAME="smartpot"
CONFIG_SMART_POT_MQTT_PASSWORD=""
CONFIG_SMART_POT_LLM_ENABLE=y
CONFIG_SMART_POT_LLM_ENDPOINT="http://103.236.87.90:18080/v1/chat/completions"
CONFIG_SMART_POT_DEEPSEEK_API_KEY=""
CONFIG_SMART_POT_DEEPSEEK_MODEL="deepseek-chat"
CONFIG_SMART_POT_ASR_ENABLE=n
CONFIG_SMART_POT_VOLC_API_KEY=""
CONFIG_SMART_POT_ASR_ENDPOINT="wss://openspeech.bytedance.com/api/v3/sauc/bigmodel_async"
CONFIG_SMART_POT_VOLC_ASR_RESOURCE_ID="volc.seedasr.sauc.duration"
CONFIG_SMART_POT_ASR_MAX_RECORD_MS=8000
CONFIG_SMART_POT_ASR_END_WINDOW_MS=700
CONFIG_SMART_POT_TTS_ENABLE=n
CONFIG_SMART_POT_TTS_ENDPOINT="wss://openspeech.bytedance.com/api/v3/tts/bidirection"
CONFIG_SMART_POT_VOLC_TTS_RESOURCE_ID="seed-tts-2.0"
CONFIG_SMART_POT_VOLC_TTS_SPEAKER="zh_female_yingtaowanzi_uranus_bigtts"
CONFIG_SMART_POT_VOLC_TTS_SAMPLE_RATE=24000
CONFIG_SMART_POT_TTS_STARTUP_TEST=n
CONFIG_SMART_POT_VOICE_WAKE_ENABLE=y
CONFIG_SMART_POT_VOICE_WAKE_THRESHOLD=1800
CONFIG_SMART_POT_VOICE_WAKE_COOLDOWN_MS=1500
CONFIG_SMART_POT_SENSOR_HARDWARE_ENABLE=y
CONFIG_SMART_POT_SENSOR_UPDATE_MS=2000
CONFIG_SMART_POT_BH1750_ENABLE=y
CONFIG_SMART_POT_BH1750_ADDR_SELECT=0
CONFIG_SMART_POT_BH1750_USE_BSP_I2C=y
CONFIG_SMART_POT_BH1750_I2C_PORT=1
CONFIG_SMART_POT_BH1750_SDA_GPIO=-1
CONFIG_SMART_POT_BH1750_SCL_GPIO=-1
CONFIG_SMART_POT_BH1750_MAX_LUX=1200
# CONFIG_BSP_I2C_FAST_MODE is not set
CONFIG_SMART_POT_MPU6050_ENABLE=y
CONFIG_SMART_POT_MPU6050_ADDRESS=0x68
CONFIG_SMART_POT_MPU6050_DEBUG_LOG=y
CONFIG_SMART_POT_MPU6050_TAP_DELTA_MG=1500
CONFIG_SMART_POT_MPU6050_TAP_GYRO_MAX_DPS=120
CONFIG_SMART_POT_MPU6050_TAP_COOLDOWN_MS=120
CONFIG_SMART_POT_MPU6050_DOUBLE_TAP_MIN_MS=300
CONFIG_SMART_POT_MPU6050_DOUBLE_TAP_MAX_MS=800
CONFIG_SMART_POT_MPU6050_SHAKE_ACCEL_MG=1800
CONFIG_SMART_POT_MPU6050_SHAKE_GYRO_DPS=150
CONFIG_SMART_POT_MPU6050_SHAKE_COOLDOWN_MS=1500
CONFIG_SMART_POT_MPU6050_MOVE_TILT_DELTA_DEG=15
CONFIG_SMART_POT_MPU6050_MOVE_CONFIRM_MS=1000
CONFIG_SMART_POT_MPU6050_MOVE_STABLE_MS=3000
CONFIG_SMART_POT_MPU6050_STATIC_DELTA_MG=80
CONFIG_SMART_POT_MPU6050_STATIC_GYRO_DPS=5
CONFIG_SMART_POT_MPU6050_TILT_LIGHT_DEG=15
CONFIG_SMART_POT_MPU6050_TILT_SEVERE_DEG=45
CONFIG_SMART_POT_MPU6050_TILT_RECOVER_DEG=10
CONFIG_SMART_POT_MPU6050_TILT_CONFIRM_MS=2000
CONFIG_SMART_POT_TTP223_ENABLE=y
CONFIG_SMART_POT_TTP223_GPIO=48
CONFIG_SMART_POT_TTP223_ACTIVE_HIGH=y
CONFIG_SMART_POT_SOIL_555_ENABLE=y
CONFIG_SMART_POT_SOIL_555_GPIO=47
CONFIG_SMART_POT_SOIL_555_SAMPLE_MS=250
CONFIG_SMART_POT_SOIL_555_DRY_HZ=2500
CONFIG_SMART_POT_SOIL_555_WET_HZ=500
CONFIG_SMART_POT_SOIL_MODULE_ENABLE=y
CONFIG_SMART_POT_SOIL_MODULE_DO_GPIO=47
CONFIG_SMART_POT_SOIL_MODULE_AO_GPIO=22
CONFIG_SMART_POT_SOIL_ADC_SAMPLES=8
CONFIG_SMART_POT_SOIL_ADC_DRY_RAW=4095
CONFIG_SMART_POT_SOIL_ADC_WET_RAW=0

CONFIG_MODEL_IN_FLASH=y
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_WN_WN9_NI3HAO3XIAO3MAI4_TTS2=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=64
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=64
